app/controllers/store_controller.rb

  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2011-08-19 03:35:34', 1, 2, 1, 59.9, '2011-08-19 03:35:34')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('mikerzhou', '123 Main St', '2011-08-19 03:35:34', '2011-08-19 03:35:34', 'check', 'mikerzhou')